{
  "products": [
    {
      "id": 1001,
      "name": "The C++ Programming Language 4th Edition",
      "overview": "The definitive book on C++ by the creator of C++, Brarne Stroustrup. The C++ Programming Language teaches one of the most widely-used, general-purpose programming languages at an advanced pace.",
      "details": "The delivers meticulous, richly explained, and integrated coverage of the entire language—its facilities, abstraction mechanisms, standard libraries, and key design techniques. Throughout, Stroustrup presents concise, “pure C++11” examples, which have been carefully crafted to clarify both usage and program design. To promote deeper understanding, the author provides extensive cross-references, both within the book and to the ISO standard.",
      "price": 40,
      "poster": "https://m.media-amazon.com/images/I/5197qo6Q1GL.jpg",
      "discount": 40,
      "reduced_price": 23.99,
      "rating": 4,
      "in_stock": true,
      "size": 5,
      "best_seller": true
    },
    {
      "id": 1002,
      "name": "The Go Programming Language",
      "overview": "The book will quickly get students started using Go effectively from the beginning, and by the end, they will know how to use it well to write clear, idiomatic and efficient programs to solve real-world problems.",
      "details": "The Go Programming Language is the authoritative resource for any programmer who wants to learn Go quickly and effectively. It assumes no prior knowledge of Go nor prior experience with any specific language, so it provides a solid foundation whether your previous experience is with JavaScript, Ruby, Python, Java, or C++. This guide will show you how to write efficient and idiomatic Go, making good use of its standard libraries to solve real-world problems.",
      "poster": "https://m.media-amazon.com/images/I/81VkKMf607L._SL1500_.jpg",
      "price": 21.99,
      "discount": 30,
      "reduced_price": 14.7,
      "rating": 5,
      "in_stock": false,
      "size": 23.8,
      "best_seller": true
    },
    {
      "id": 1003,
      "name": "Programming Rust: Fast, Safe Systems Development, 2nd Edition",
      "overview": "Learn the Rust systems programming language combines that control with a modern type system that catches broad classes of common mistakes, from memory management errors to interthread data races.",
      "details": "Systems programming provides the foundation for the world's computation. Writing performance-sensitive code requires a programming language that puts programmers in control of how memory, processor time, and other system resources are used. The Rust systems programming language combines that control with a modern type system that catches broad classes of common mistakes, from memory management errors to data races between threads.",
      "poster": "https://m.media-amazon.com/images/I/71Oe8XdC+eS._SL1315_.jpg",
      "price": 39.99,
      "discount": 50,
      "reduced_price": 20,
      "rating": 4,
      "in_stock": false,
      "size": 21.25,
      "best_seller": true
    },
    {
      "id": 1004,
      "name": "Node.js: The Comprehensive Guide",
      "overview": "Follow detailed code examples to learn about web development using frameworks like Express and Nest. Learn about different approaches to asynchronous programming, including RxJS and data streams.",
      "details": "If you’re developing server-side JavaScript applications, you need Node.js! Start with the basics of the Node.js environment: installation, application structure, and modules. Then follow detailed code examples to learn about web development using frameworks like Express and Nest. Learn about different approaches to asynchronous programming, including RxJS and data streams. Details on peripheral topics such as testing, security, and performance make this your all-in-one daily reference for Node.js!",
      "poster": "https://m.media-amazon.com/images/I/71QGTZ8txsL._SL1465_.jpg",
      "price": 24.99,
      "discount": 35,
      "reduced_price": 16.25,
      "rating": 4,
      "in_stock": true,
      "size": 33,
      "best_seller": false
    },
    {
      "id": 1005,
      "name": "Data Structures And Algorithms Made Easy: Data Structures And Algorithmic Puzzles",
      "overview": "Iis a book that offers solutions to complex data structures and algorithms. It can be used as a reference manual by those readers in the computer science industry.",
      "details": "The book is a solution bank for various complex problems related to data structures and algorithms. It can be used as a reference manual by those readers in the computer science industry. The book has around 21 chapters and covers Recursion and Backtracking, Linked Lists, Stacks, Queues, Trees, Priority Queue and Heaps, Disjoint Sets ADT, Graph Algorithms, Sorting, Searching, Selection Algorithms Medians], Symbol Tables, Hashing, String Algorithms, Algorithms Design Techniques, Greedy Algorithms, Divide and Conquer Algorithms, Dynamic Programming, Complexity Classes, and other Miscellaneous Concepts.",
      "poster": "https://m.media-amazon.com/images/I/714+tgyHDRL._SL1360_.jpg",
      "price": 27,
      "discount": 50,
      "reduced_price": 13.5,
      "rating": 4,
      "in_stock": true,
      "size": 19,
      "best_seller": true
    },
    {
      "id": 1006,
      "name": "Advanced API Security: OAuth 2.0 and Beyond",
      "overview": "Prepare for the next wave of challenges in enterprise security. Learn to better protect, monitor, and manage your public and private APIs.",
      "details": "Enterprise APIs have become the common way of exposing business functions to the outside world. Exposing functionality is convenient, but of course comes with a risk of exploitation. This book teaches you about TLS Token Binding, User Managed Access (UMA) 2.0, Cross Origin Resource Sharing (CORS), Incremental Authorization, Proof Key for Code Exchange (PKCE), and Token Exchange. Benefit from lessons learned from analyzing multiple attacks that have taken place by exploiting security vulnerabilities in various OAuth 2.0 implementations. Explore root causes, and improve your security practices to mitigate against similar future exploits.",
      "poster": "https://m.media-amazon.com/images/I/61F0U6I+iwL._SL1429_.jpg",
      "price": 12,
      "discount": 25,
      "reduced_price": 9,
      "rating": 3,
      "in_stock": false,
      "size": 15,
      "best_seller": false
    },
    {
      "id": 1007,
      "name": "Modern C++ Programming Cookbook, 2nd Ed",
      "overview": "A pragmatic recipe book for acquiring a comprehensive understanding of the complexities and core fundamentals of C++ programming.",
      "details": "C++ has come a long way to be one of the most widely used general-purpose languages that is fast, efficient, and high-performance at its core. The book also delves into the details of all the core concepts in modern C++ programming, such as functions and classes, iterators and algorithms, streams and the file system, threading and concurrency, smart pointers and move semantics, and many others. It goes into the performance aspects of programming in depth, teaching developers how to write fast and lean code with the help of best practices.",
      "poster": "https://m.media-amazon.com/images/I/71SNYbLo1RL._SL1360_.jpg",
      "price": 25.35,
      "discount": 22,
      "reduced_price": 19.75,
      "rating": 4,
      "in_stock": false,
      "size": 7,
      "best_seller": false
    },
    {
      "id": 1008,
      "name": "Mastering GoLang: From Basics to Advanced Features",
      "overview": "A comprehensive and beginner-friendly book that serves as an ideal resource for anyone looking to learn the Go programming language from scratch.",
      "details": "You will learn how to leverage GoLang's powerful features, such as goroutines and channels for concurrent programming, perform file I/O operations, handle errors effectively, write tests and benchmarks, utilize reflection and introspection, work with interfaces and embedding, and package and distribute your applications.",
      "poster": "https://m.media-amazon.com/images/I/61zcWZCt0dL._SL1500_.jpg",
      "price": 15.9,
      "discount": 45,
      "reduced_price": 8.75,
      "rating": 2,
      "in_stock": true,
      "size": 13,
      "best_seller": false
    },
    {
      "id": 1009,
      "name": "Learning OpenCV 3 Application Development",
      "overview": "Build, create and deploy your own Computer Vision applications with the power of OpenCV.",
      "details": "Computer vision and machine learning concepts are frequently used in practical computer vision based projects. If you’re a novice, this book provides the steps to build and deploy an end-to-end application in the domain of computer vision using OpenCV/C++. At the outset, we explain how to install OpenCV and demonstrate how to run some simple programs. You will start with images (the building blocks of image processing applications), and see how they are stored and processed by OpenCV.",
      "poster": "https://m.media-amazon.com/images/I/61jL+OqV2AL._SL1360_.jpg",
      "price": 19.99,
      "discount": 50,
      "reduced_price": 9.99,
      "rating": 2,
      "in_stock": true,
      "size": 13.8,
      "best_seller": false
    },
    {
      "id": 1010,
      "name": "Classic Computer Science Problems in Python",
      "overview": "Classic Computer Science Problems in Python guides you through time-tested scenarios, exercises, and algorithms that will prepare you for the new problems you’ll face when you start your next project.",
      "details": "Computer science problems that seem new or unique are often rooted in classic algorithms, coding techniques, and engineering principles. And classic approaches are still the best way to solve them! Understanding these techniques in Python expands your potential for success in web development, data munging, machine learning, and more.",
      "poster": "https://m.media-amazon.com/images/I/71iz4Wu+rhL._SL1500_.jpg",
      "price": 24,
      "discount": 40,
      "reduced_price": 14.4,
      "rating": 4,
      "in_stock": false,
      "size": 16.75,
      "best_seller": true
    },
    {
      "id": 1011,
      "name": "The Rust Programming Language",
      "overview": "It is the official book on Rust, an open-source, community-developed systems programming language that runs blazingly fast.",
      "details": "The Rust Programming Language is the official book on Rust: an open source systems programming language that helps you write faster, more reliable software. Rust offers control over low-level details (such as memory usage) in combination with high-level ergonomics, eliminating the hassle traditionally associated with low-level languages.",
      "poster": "https://m.media-amazon.com/images/I/915ZUIYHkrL._SL1500_.jpg",
      "price": 20,
      "discount": 40,
      "reduced_price": 8,
      "rating": 5,
      "in_stock": true,
      "size": 11.5,
      "best_seller": true
    },
    {
      "id": 1012,
      "name": "Concurrency in Go: Tools and Techniques for Developers",
      "overview": "Understand how Go addresses fundamental problems that make concurrency difficult to do correctly, Learn the key differences between concurrency and parallelism.",
      "details": "Concurrency can be notoriously difficult to get right, but fortunately, the Go open source programming language makes working with concurrency tractable and even easy. If you’re a developer familiar with Go, this practical book demonstrates best practices and patterns to help you incorporate concurrency into your systems.",
      "poster": "https://m.media-amazon.com/images/I/71Em6oDlE9L._SL1320_.jpg",
      "price": 16.75,
      "discount": 50,
      "reduced_price": 8.4,
      "rating": 4,
      "in_stock": true,
      "size": 17,
      "best_seller": false
    },
    {
      "id": 1013,
      "name": "Data Structures, Algorithms, And Applications In C++",
      "overview": "Learn and understand how various data structures are employed in effciently solving the problems with wise employment of algorithms using C++.",
      "details": "This text provides students with an introduction to data structures and algorithms. It emphasizes algorithm analysis and the development of efficient code, and includes important background material. Divided into three parts, the text features Data Structure Application sections at the end of each chapter in part two, Algorithm Application sections in each design method chapter in part three, and a gradual development of C++ features not found in C to help students with either a background in C or C++ to comprehend topics in the book.",
      "poster": "https://m.media-amazon.com/images/I/51LaHpxTQvL.jpg",
      "price": 21,
      "discount": 49,
      "reduced_price": 12,
      "rating": 3,
      "in_stock": false,
      "size": 1,
      "best_seller": false
    },
    {
      "id": 1014,
      "name": "LaTeX Beginner's Guide 2nd Edition",
      "overview": "Create high-quality, professional-looking documents and books for business and science using LaTeX.",
      "details": "Harness the power of LaTeX and its wide range of features to create professional-looking text, articles, and books with both online and offline capabilities of LaTeX. Get a hands-on introduction to LaTeX using fully explained examples to advance from beginner to LaTeX professional quickly.",
      "poster": "https://m.media-amazon.com/images/I/61ejvCks1-L._SL1360_.jpg",
      "price": 18,
      "discount": 25,
      "reduced_price": 13.5,
      "rating": 3,
      "in_stock": true,
      "size": 26.5,
      "best_seller": true
    },
    {
      "id": 1015,
      "name": "Learn React Hooks: Build and refactor modern React.js applications using Hooks",
      "overview": "Create large-scale web applications with code that is extensible and easy to understand using React Hooks.",
      "details": "Explore effective strategies for migrating your state management from Redux and MobX to React Hooks. Integrate Hooks with React features such as Context and Suspense to add advanced functionality to your web apps and Create complex applications by combining multiple hooks.",
      "poster": "https://m.media-amazon.com/images/I/716Pujg0d4L._SL1360_.jpg",
      "price": 15.75,
      "discount": 30,
      "reduced_price": 11,
      "rating": 4,
      "in_stock": true,
      "size": 18,
      "best_seller": false
    },
    {
      "id": 1016,
      "name": "Real World Haskell",
      "overview": "This is an easy-to-use, fast-moving tutorial that introduces you to functional programming with Haskell. ",
      "details": "This easy-to-use, fast-moving tutorial introduces you to functional programming with Haskell. You'll learn how to use Haskell in a variety of practical ways, from short scripts to large and demanding applications. Real World Haskell takes you through the basics of functional programming at a brisk pace, and then helps you increase your understanding of Haskell in real-world issues like I/O, performance, dealing with data, concurrency, and more as you move through each chapter.",
      "poster": "https://m.media-amazon.com/images/I/71fxkQd0BNL._SL1311_.jpg",
      "price": 24.75,
      "discount": 47,
      "reduced_price": 11.99,
      "rating": 4,
      "in_stock": false,
      "size": 19.75,
      "best_seller": false
    },
    {
      "id": 1017,
      "name": "Haskell in Depth, 1st Edition",
      "overview": "Unlock a new level of skill, going beyond the basics of syntax and structure, this book opens up critical topics like advanced types, concurrency, and data processing.",
      "details": "Turn the corner from “Haskell student” to “Haskell developer.” Haskell in Depth explores the important language features and programming skills you’ll need to build production-quality software using Haskell. And along the way, you’ll pick up some interesting insights into why Haskell looks and works the way it does. Get ready to go deep!",
      "poster": "https://m.media-amazon.com/images/I/712iZ3yejpS._SL1500_.jpg",
      "price": 23.5,
      "discount": 20,
      "reduced_price": 18.8,
      "rating": 4,
      "in_stock": true,
      "size": 12.5,
      "best_seller": false
    },
    {
      "id": 1018,
      "name": "Beginning ReactJS Foundations Building User Interfaces with ReactJS: An Approachable Guide 1st Edition",
      "overview": "Quickly learn the most widely used front-end development language with ease and confidence.",
      "details": "Written by an accomplished full-stack engineer, speaker, and community organizer, React JS Foundations teaches readers how to understand React and how to begin building applications with it. The book explains and clarifies technical terminology with relevant and modern examples to assist people new to programming understand the language and Helps experienced programmers quickly get up to speed with React.",
      "poster": "https://m.media-amazon.com/images/I/71f7ATQsGwL._SL1500_.jpg",
      "price": 31.7,
      "discount": 17,
      "reduced_price": 26.23,
      "rating": 3,
      "in_stock": true,
      "size": 8.5,
      "best_seller": false
    },
    {
      "id": 1019,
      "name": "C++ Concurrency in Action 2nd Edition",
      "overview": "Teaches you everything you need to write robust and elegant multithreaded applications in C++17.",
      "details": "C++ Concurrency in Action, Second Edition is the definitive guide to writing elegant multithreaded applications in C++. Updated for C++ 17, it carefully addresses every aspect of concurrent development, from starting new threads to designing fully functional multithreaded algorithms and data structures. Concurrency master Anthony Williams presents examples and practical tasks in every chapter, including insights that will delight even the most experienced developer.",
      "poster": "https://m.media-amazon.com/images/I/71PTx9idNnL._SL1500_.jpg",
      "price": 57,
      "discount": 12,
      "reduced_price": 58.99,
      "rating": 3,
      "in_stock": true,
      "size": 14.75,
      "best_seller": false
    },
    {
      "id": 1020,
      "name": "Eloquent JavaScript, 3rd Edition: A Modern Introduction to Programming",
      "overview": "Completely revised and updated, this best-selling introduction to programming in JavaScript focuses on writing real applications.",
      "details": "JavaScript lies at the heart of almost every modern web application, from social apps like Twitter to browser-based game frameworks like Phaser and Babylon. Though simple for beginners to pick up and play with, JavaScript is a flexible, complex language that you can use to build full-scale applications. Understand the essential elements of programming, including syntax, control, and data. Organize and clarify your code with object-oriented and functional programming techniques and Script the browser and make basic web applications.",
      "poster": "https://m.media-amazon.com/images/I/91asIC1fRwL._SL1500_.jpg",
      "price": 29.32,
      "discount": 25,
      "reduced_price": 21.99,
      "rating": 5,
      "in_stock": true,
      "size": 11.5,
      "best_seller": true
    },
    {
      "id": 1021,
      "name": "LaTeX Graphics with TikZ: A practitioner's guide to drawing 2D and 3D images, diagrams, charts and plots",
      "overview": "Unleash the power of LaTeX to create professional text, articles, diagrams, and charts using TikZ and its wide range of features for stunning 2D and 3D effects.",
      "details": "In this first-of-its-kind TikZ book, you’ll embark on a journey to discover the fascinating realm of TikZ—what it’s about, the philosophy behind it, and what sets it apart from other graphics libraries. From installation procedures to the intricacies of its syntax, this comprehensive guide will help you use TikZ to create flawless graphics to captivate your audience in theses, articles, or books.",
      "poster": "https://m.media-amazon.com/images/I/61cmDkGeK2L._SL1360_.jpg",
      "price": 56.32,
      "discount": 29,
      "reduced_price": 39.99,
      "rating": 4,
      "in_stock": true,
      "size": 18.7,
      "best_seller": true
    },
    {
      "id": 1022,
      "name": "Learn Data Structures and Algorithms with Golang: Level up your Go programming skills to develop faster and more efficient code",
      "overview": "Explore Golang's data structures and algorithms to design, implement, and analyze code in the professional setting.",
      "details": "The book begins with an introduction to Go data structures and algorithms. You'll learn how to store data using linked lists, arrays, stacks, and queues. Moving ahead, you'll discover how to implement sorting and searching algorithms, followed by binary search trees. This book will also help you improve the performance of your applications by stringing data types and implementing hash structures in algorithm design. Finally, you'll be able to apply traditional data structures to solve real-world problems.",
      "poster": "https://m.media-amazon.com/images/I/61ceIDOCCNL._SL1360_.jpg",
      "price": 36.36,
      "discount": 45,
      "reduced_price": 20,
      "rating": 2,
      "in_stock": true,
      "size": 6.5,
      "best_seller": false
    },
    {
      "id": 1023,
      "name": "The Kubernetes Book: 2023 Edition (Mastering Kubernetes Book 1)",
      "overview": "This 2023 edition of The Kubernetes Book, by Nigel Poulton, renowned author and video trainer, is up to date with the latest trends in Kubernetes (version 1.26+) and the rapidly evolving cloud-native ecosystem.",
      "details": "The Kubernetes Book offers a beginner-friendly approach to mastering Kubernetes architecture and core concepts such as Pods, Deployments, Services, StatefulSets, Ingress, ConfigMaps, and more. It also demystifies the Kubernetes API, teaches you how to secure Kubernetes, and brings you up to speed with important cloud-native concepts such as microservices, declarative configuration, desired state, reconciliation, and more.",
      "poster": "https://m.media-amazon.com/images/I/71cO9fNkJRL._SL1500_.jpg",
      "price": 47.5,
      "discount": 30,
      "reduced_price": 33.25,
      "rating": 5,
      "in_stock": true,
      "size": 18,
      "best_seller": true
    },
    {
      "id": 1024,
      "name": "Docker Deep Dive: Zero to Docker in a single book",
      "overview": "Provides comprehensive explanations of core concepts and offers step-by-step guidance on creating and managing containerized applications – from source code to executing in the cloud.",
      "details": "If you are looking for a comprehensive resource to help you master Docker and containers in the real world, this book is for you. As well as giving you valuable knowledge and skills, it offers insights and tips to help you navigate the container and cloud-native ecosystems with confidence.",
      "poster": "https://m.media-amazon.com/images/I/71x8bx6msOL._SL1500_.jpg",
      "price": 46.95,
      "discount": 47,
      "reduced_price": 9.99,
      "rating": 4,
      "in_stock": true,
      "size": 9.5,
      "best_seller": false
    },
    {
      "id": 1025,
      "name": "Keycloak - Identity and Access Management for Modern Applications: Harness the power of Keycloak, OpenID Connect, and OAuth 2.0 to secure applications 2nd ed. Edition",
      "overview": "Gain a practical understanding of Keycloak to enable authentication and authorization in applications while leveraging the additional features provided by Keycloak.",
      "details": "In this new edition, you will learn how to use the latest distribution of Keycloak. The recent versions of Keycloak are now based on Quarkus, which brings a new and improved user experience and a new admin console with a higher focus on usability. You will see how to leverage Spring Security, instead of the Keycloak Spring adapter while using Keycloak 22. As you progress, you’ll understand the new Keycloak distribution and explore best practices in using OAuth. Finally, you'll cover general best practices and other information on how to protect your applications.",
      "poster": "https://m.media-amazon.com/images/I/619P34bUOiL._SL1360_.jpg",
      "price": 44.44,
      "discount": 77,
      "reduced_price": 34.67,
      "rating": 3,
      "in_stock": true,
      "size": 12.8,
      "best_seller": false
    },
    {
      "id": 1026,
      "name": "Python for Data Analysis: Data Wrangling with pandas, NumPy, and Jupyter 3rd Edition",
      "overview": "The definitive handbook for manipulating, processing, cleaning, and crunching datasets in Python. Updated for Python 3.10 and pandas 1.4",
      "details": "This hands-on guide is packed with practical case studies that show you how to solve a broad set of data analysis problems effectively. Written by Wes McKinney, the creator of the Python pandas project, this book is a practical, modern introduction to data science tools in Python. It's ideal for analysts new to Python and for Python programmers new to data science and scientific computing. Data files and related material are available on GitHub.",
      "poster": "https://m.media-amazon.com/images/I/91QBEYSpnLL._SL1500_.jpg",
      "price": 43.99,
      "discount": 21,
      "reduced_price": 35,
      "rating": 4,
      "in_stock": true,
      "size": 16.35,
      "best_seller": true
    },
    {
      "id": 1027,
      "name": "Introduction to Deep Learning: From Logical Calculus to Artificial Intelligence",
      "overview": "This textbook presents a concise, accessible and engaging first introduction to deep learning, offering a wide range of connectionist models which represent the current state-of-the-art.",
      "details": "The text explores the most popular algorithms and architectures in a simple and intuitive style, explaining the mathematical derivations in a step-by-step manner. The content coverage includes convolutional networks, LSTMs, Word2vec, RBMs, DBNs, neural Turing machines, memory networks and autoencoders. Numerous examples in working Python code are provided throughout the book, and the code is also supplied separately at an accompanying website.",
      "poster": "https://m.media-amazon.com/images/I/61Fbas8AQeL._SL1254_.jpg",
      "price": 34.33,
      "discount": 55,
      "reduced_price": 16.45,
      "rating": 1,
      "in_stock": true,
      "size": 19.75,
      "best_seller": false
    },
    {
      "id": 1028,
      "name": "Hands-On Korn Shell and AWK Scripting",
      "overview": "Learn Unix and Linux Programming Through Advanced Scripting Examples.",
      "details": "Learn to harness the programming power that comes standard with all unix and linux systems (including Apple's OSX). This guide encourages hands-on experimentation by including actual scripts that feature the korn shell (ksh), awk, and sed.",
      "poster": "https://m.media-amazon.com/images/I/51XDaoX6GpL._SL1360_.jpg",
      "price": 57.32,
      "discount": 75,
      "reduced_price": 14.33,
      "rating": 1,
      "in_stock": false,
      "size": 7.56,
      "best_seller": false
    },
    {
      "id": 1029,
      "name": "Erlang and OTP in Action 1st Edition",
      "overview": "Apply Erlang's message passing model for concurrent programming a completely different way of tackling the problem of parallel programming from the more common multi-threaded approach.",
      "details": "Concurrent programming has become a required discipline for all programmers. Multi-core processors and the increasing demand for maximum performance and scalability in mission-critical applications have renewed interest in functional languages like Erlang that are designed to handle concurrent programming. Erlang, and the OTP platform, make it possible to deliver more robust applications that satisfy rigorous uptime and performance requirements. Erlang and OTP in Action teaches you to apply Erlang's message passing model for concurrent programming--a completely different way of tackling the problem of parallel programming from the more common multi-threaded approach. This book walks you through the practical considerations and steps of building systems in Erlang and integrating them with real-world C/C++, Java, and .NET applications. Unlike other books on the market, Erlang and OTP in Action offers a comprehensive view of how concurrency relates to SOA and web technologies. This hands-on guide is perfect for readers just learning Erlang or for those who want to apply their theoretical knowledge of this powerful language. You'll delve into the Erlang language and OTP runtime by building several progressively more interesting real-world distributed applications. Once you are competent in the fundamentals of Erlang, the book takes you on a deep dive into the process of designing complex software systems in Erlang.",
      "poster": "https://m.media-amazon.com/images/I/715viYQgzRL._SL1500_.jpg",
      "price": 29.95,
      "rating": 4,
      "in_stock": false,
      "size": 12.37,
      "best_seller": false
    },
    {
      "id": 1030,
      "name": "Responsive Web Design with HTML5 and CSS",
      "overview": "Build future-proof responsive websites using the latest HTML5 and CSS techniques.",
      "details": "Harness the latest capabilities of HTML5 and CSS to create a single UI that works flawlessly on mobile phones, tablets, and desktops. By the end of the book, you will not only have a comprehensive understanding of responsive web design and what is possible with the latest HTML5 and CSS, but also the knowledge of how to best implement each technique. Read through as a complete guide or dip in as a reference for each topic-focused chapter.",
      "poster": "https://m.media-amazon.com/images/I/61wpcZO+S2L._SL1360_.jpg",
      "price": 22.39,
      "rating": 5,
      "in_stock": true,
      "size": 20.48,
      "best_seller": false
    }
  ],
  "featured_products": [
    {
      "id": 1003,
      "name": "Programming Rust: Fast, Safe Systems Development, 2nd Edition",
      "overview": "Learn the Rust systems programming language combines that control with a modern type system that catches broad classes of common mistakes, from memory management errors to interthread data races.",
      "details": "Systems programming provides the foundation for the world's computation. Writing performance-sensitive code requires a programming language that puts programmers in control of how memory, processor time, and other system resources are used. The Rust systems programming language combines that control with a modern type system that catches broad classes of common mistakes, from memory management errors to data races between threads.",
      "poster": "https://m.media-amazon.com/images/I/71Oe8XdC+eS._SL1315_.jpg",
      "price": 39.99,
      "discount": 50,
      "reduced_price": 20,
      "rating": 4,
      "in_stock": true,
      "size": 21,
      "best_seller": true
    },
    {
      "id": 1015,
      "name": "Learn React Hooks: Build and refactor modern React.js applications using Hooks",
      "overview": "Create large-scale web applications with code that is extensible and easy to understand using React Hooks.",
      "details": "Explore effective strategies for migrating your state management from Redux and MobX to React Hooks. Integrate Hooks with React features such as Context and Suspense to add advanced functionality to your web apps and Create complex applications by combining multiple hooks.",
      "poster": "https://m.media-amazon.com/images/I/716Pujg0d4L._SL1360_.jpg",
      "price": 15.75,
      "discount": 30,
      "reduced_price": 11,
      "rating": 4,
      "in_stock": true,
      "size": 8,
      "best_seller": false
    },
    {
      "id": 1019,
      "name": "C++ Concurrency in Action 2nd Edition",
      "overview": "Teaches you everything you need to write robust and elegant multithreaded applications in C++17.",
      "details": "C++ Concurrency in Action, Second Edition is the definitive guide to writing elegant multithreaded applications in C++. Updated for C++ 17, it carefully addresses every aspect of concurrent development, from starting new threads to designing fully functional multithreaded algorithms and data structures. Concurrency master Anthony Williams presents examples and practical tasks in every chapter, including insights that will delight even the most experienced developer.",
      "poster": "https://m.media-amazon.com/images/I/71PTx9idNnL._SL1500_.jpg",
      "price": 57,
      "discount": 12,
      "reduced_price": 58.99,
      "rating": 4,
      "in_stock": true,
      "size": 14.75,
      "best_seller": false
    },
    {
      "id": 1011,
      "name": "The Rust Programming Language",
      "overview": "It is the official book on Rust, an open-source, community-developed systems programming language that runs blazingly fast.",
      "details": "The Rust Programming Language is the official book on Rust: an open source systems programming language that helps you write faster, more reliable software. Rust offers control over low-level details (such as memory usage) in combination with high-level ergonomics, eliminating the hassle traditionally associated with low-level languages.",
      "poster": "https://m.media-amazon.com/images/I/915ZUIYHkrL._SL1500_.jpg",
      "price": 20,
      "discount": 40,
      "reduced_price": 8,
      "rating": 4,
      "in_stock": true,
      "size": 11.5,
      "best_seller": true
    },
    {
      "id": 1023,
      "name": "The Kubernetes Book: 2023 Edition (Mastering Kubernetes Book 1)",
      "overview": "This 2023 edition of The Kubernetes Book, by Nigel Poulton, renowned author and video trainer, is up to date with the latest trends in Kubernetes (version 1.26+) and the rapidly evolving cloud-native ecosystem.",
      "details": "The Kubernetes Book offers a beginner-friendly approach to mastering Kubernetes architecture and core concepts such as Pods, Deployments, Services, StatefulSets, Ingress, ConfigMaps, and more. It also demystifies the Kubernetes API, teaches you how to secure Kubernetes, and brings you up to speed with important cloud-native concepts such as microservices, declarative configuration, desired state, reconciliation, and more.",
      "poster": "https://m.media-amazon.com/images/I/71cO9fNkJRL._SL1500_.jpg",
      "price": 47.5,
      "discount": 30,
      "reduced_price": 33.25,
      "rating": 5,
      "in_stock": true,
      "size": 18,
      "best_seller": true
    },
    {
      "id": 1006,
      "name": "Advanced API Security: OAuth 2.0 and Beyond",
      "overview": "Prepare for the next wave of challenges in enterprise security. Learn to better protect, monitor, and manage your public and private APIs.",
      "details": "Enterprise APIs have become the common way of exposing business functions to the outside world. Exposing functionality is convenient, but of course comes with a risk of exploitation. This book teaches you about TLS Token Binding, User Managed Access (UMA) 2.0, Cross Origin Resource Sharing (CORS), Incremental Authorization, Proof Key for Code Exchange (PKCE), and Token Exchange. Benefit from lessons learned from analyzing multiple attacks that have taken place by exploiting security vulnerabilities in various OAuth 2.0 implementations. Explore root causes, and improve your security practices to mitigate against similar future exploits.",
      "poster": "https://m.media-amazon.com/images/I/61F0U6I+iwL._SL1429_.jpg",
      "price": 12,
      "discount": 25,
      "reduced_price": 9,
      "rating": 3,
      "in_stock": true,
      "size": 15,
      "best_seller": false
    }
  ],
  "orders": [
    {
      "cartList": [
        {
          "id": 1015,
          "name": "Learn React Hooks: Build and refactor modern React.js applications using Hooks",
          "overview": "Create large-scale web applications with code that is extensible and easy to understand using React Hooks.",
          "details": "Explore effective strategies for migrating your state management from Redux and MobX to React Hooks. Integrate Hooks with React features such as Context and Suspense to add advanced functionality to your web apps and Create complex applications by combining multiple hooks.",
          "poster": "https://m.media-amazon.com/images/I/716Pujg0d4L._SL1360_.jpg",
          "price": 15.75,
          "discount": 30,
          "reduced_price": 11,
          "rating": 4,
          "in_stock": true,
          "size": 18,
          "best_seller": false
        },
        {
          "id": 1017,
          "name": "Haskell in Depth, 1st Edition",
          "overview": "Unlock a new level of skill, going beyond the basics of syntax and structure, this book opens up critical topics like advanced types, concurrency, and data processing.",
          "details": "Turn the corner from “Haskell student” to “Haskell developer.” Haskell in Depth explores the important language features and programming skills you’ll need to build production-quality software using Haskell. And along the way, you’ll pick up some interesting insights into why Haskell looks and works the way it does. Get ready to go deep!",
          "poster": "https://m.media-amazon.com/images/I/712iZ3yejpS._SL1500_.jpg",
          "price": 23.5,
          "discount": 20,
          "reduced_price": 18.8,
          "rating": 4,
          "in_stock": true,
          "size": 12.5,
          "best_seller": false
        },
        {
          "id": 1019,
          "name": "C++ Concurrency in Action 2nd Edition",
          "overview": "Teaches you everything you need to write robust and elegant multithreaded applications in C++17.",
          "details": "C++ Concurrency in Action, Second Edition is the definitive guide to writing elegant multithreaded applications in C++. Updated for C++ 17, it carefully addresses every aspect of concurrent development, from starting new threads to designing fully functional multithreaded algorithms and data structures. Concurrency master Anthony Williams presents examples and practical tasks in every chapter, including insights that will delight even the most experienced developer.",
          "poster": "https://m.media-amazon.com/images/I/71PTx9idNnL._SL1500_.jpg",
          "price": 57,
          "discount": 12,
          "reduced_price": 58.99,
          "rating": 3,
          "in_stock": true,
          "size": 14.75,
          "best_seller": false
        }
      ],
      "amount_paid": 88.79,
      "quantity": 3,
      "user": {
        "name": "sampath singamsetty",
        "email": "sampath.singamsetty@gmail.com",
        "id": 1
      },
      "id": 1
    },
    {
      "cartList": [
        {
          "id": 1004,
          "name": "Node.js: The Comprehensive Guide",
          "overview": "Follow detailed code examples to learn about web development using frameworks like Express and Nest. Learn about different approaches to asynchronous programming, including RxJS and data streams.",
          "details": "If you’re developing server-side JavaScript applications, you need Node.js! Start with the basics of the Node.js environment: installation, application structure, and modules. Then follow detailed code examples to learn about web development using frameworks like Express and Nest. Learn about different approaches to asynchronous programming, including RxJS and data streams. Details on peripheral topics such as testing, security, and performance make this your all-in-one daily reference for Node.js!",
          "poster": "https://m.media-amazon.com/images/I/71QGTZ8txsL._SL1465_.jpg",
          "price": 24.99,
          "discount": 35,
          "reduced_price": 16.25,
          "rating": 4,
          "in_stock": true,
          "size": 33,
          "best_seller": false
        }
      ],
      "amount_paid": 16.25,
      "quantity": 1,
      "user": {
        "name": "sampath singamsetty",
        "email": "sampath.singamsetty@gmail.com",
        "id": 1
      },
      "id": 2
    },
    {
      "cartList": [
        {
          "id": 1008,
          "name": "Mastering GoLang: From Basics to Advanced Features",
          "overview": "A comprehensive and beginner-friendly book that serves as an ideal resource for anyone looking to learn the Go programming language from scratch.",
          "details": "You will learn how to leverage GoLang's powerful features, such as goroutines and channels for concurrent programming, perform file I/O operations, handle errors effectively, write tests and benchmarks, utilize reflection and introspection, work with interfaces and embedding, and package and distribute your applications.",
          "poster": "https://m.media-amazon.com/images/I/61zcWZCt0dL._SL1500_.jpg",
          "price": 15.9,
          "discount": 45,
          "reduced_price": 8.75,
          "rating": 2,
          "in_stock": true,
          "size": 13,
          "best_seller": false
        }
      ],
      "amount_paid": 8.75,
      "quantity": 1,
      "user": {
        "name": "Sampath Singamsetty",
        "email": "sampath.singamsetty@gmail.com",
        "id": 1
      },
      "id": 3
    },
    {
      "cartList": [
        {
          "id": 1018,
          "name": "Beginning ReactJS Foundations Building User Interfaces with ReactJS: An Approachable Guide 1st Edition",
          "overview": "Quickly learn the most widely used front-end development language with ease and confidence.",
          "details": "Written by an accomplished full-stack engineer, speaker, and community organizer, React JS Foundations teaches readers how to understand React and how to begin building applications with it. The book explains and clarifies technical terminology with relevant and modern examples to assist people new to programming understand the language and Helps experienced programmers quickly get up to speed with React.",
          "poster": "https://m.media-amazon.com/images/I/71f7ATQsGwL._SL1500_.jpg",
          "price": 31.7,
          "discount": 17,
          "reduced_price": 26.23,
          "rating": 3,
          "in_stock": true,
          "size": 8.5,
          "best_seller": false
        }
      ],
      "amount_paid": 26.23,
      "quantity": 1,
      "user": {
        "name": "Sampath Singamsetty",
        "email": "sampath.singamsetty@gmail.com",
        "id": 1
      },
      "id": 4
    }
  ],
  "users": [
    {
      "email": "sampath.singamsetty@gmail.com",
      "password": "$2a$10$wc1SDtfCAHYqfGndJrqvteisgO0YrPRxT2Ond2wRIyfrnrBs9QYKe",
      "name": "Sampath Singamsetty",
      "id": 1
    },
    {
      "email": "sampath.singamsetty@united.com",
      "password": "$2a$10$AZsc43ObAsxmc1PVq6Hg1uwKBzalLa43eaRgaZCgpvkic6IKftKJO",
      "name": "Sampath S",
      "id": 2
    }
  ]
}
